package main

import "fmt"

func main() {

	var a int8 = 4
	var b int8 = 64
	fmt.Printf("왼쪽시프트 예제 - a:%08b a<<2: %08b a<<2: %d\n", a, a<<2, a<<2)
	fmt.Printf("왼쪽시프트 예제 - b:%08b b<<2: %08b b<<2: %d\n", b, b<<2, b<<2)
	// 왼쪽시프트 예제 - a:00000100 a<<2: 00010000 a<<2: 16
	// 왼쪽시프트 예제 - b:01000000 b<<2: 00000000 b<<2: 0

	var c int8 = 16
	var d int8 = -128
	var e int8 = -1
	var f uint8 = 128
	fmt.Printf("오른쪽시프트 예제 - c:%08b c>>2: %08b c>>2: %d\n", c, c>>2, c>>2)
	fmt.Printf("오른쪽시프트 예제 - d:%08b d>>2: %08b d>>2: %d\n", d, d>>2, d>>2)
	fmt.Printf("오른쪽시프트 예제 - e:%08b e>>2: %08b e>>2: %d\n", e, e>>2, e>>2)
	fmt.Printf("오른쪽시프트 예제 - f:%08b f>>2: %08b f>>2: %d\n", f, f>>2, f>>2)
	// 오른쪽시프트 예제 - c:00010000 c>>2: 00000100 c>>2: 4
	// 오른쪽시프트 예제 - d:-10000000 d>>2: -0100000 d>>2: -32
	// 오른쪽시프트 예제 - e:-0000001 e>>2: -0000001 e>>2: -1
	// 오른쪽시프트 예제 - f:10000000 f>>2: 00100000 f>>2: 32

	fmt.Printf("오른쪽시프트 예제 - d:%08b d>>2: %08b d>>2: %d\n", uint8(d), uint8(d>>2), d>>2)
	fmt.Printf("오른쪽시프트 예제 - e:%08b e>>2: %08b e>>2: %d\n", uint8(e), uint8(e>>2), e>>2)
	fmt.Printf("오른쪽시프트 예제 - f:%08b f>>2: %08b f>>2: %d\n", uint8(f), uint8(f>>2), f>>2)
	// 오른쪽시프트 예제 - d:10000000 d>>2: 11100000 d>>2: -32
	// 오른쪽시프트 예제 - e:11111111 e>>2: 11111111 e>>2: -1
	// 오른쪽시프트 예제 - f:10000000 f>>2: 00100000 f>>2: 32
}
